БухЭксп/Documents/CW_ВводОстатковНезавершенногоПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_ВводОстатковНезавершенногоПроизводства</Name>
			<BasedOn>
				<xr:Item>Document.CW_РасходыПоГрузоперевозке</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CW_НезавершенноеПроизводство</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокументаВалютная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокОтражения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособУчетаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыУчетаНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>"Сумма" в базовой валюте учета</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Comment>"НДС" в базовой валюте учета</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Comment>"Всего" в базовой валюте учета</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма_Валюта</Name>
							<Comment>"Сумма" в валюте договора</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС_Валюта</Name>
							<Comment>"НДС" в валюте договора</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего_Валюта</Name>
							<Comment>"Всего" в валюте договора</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Покупатель</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорПокупателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриложениеКДоговоруПокупателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_НезавершенноеПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_НезавершенноеПроизводство</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>"Сумма" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Comment>"НДС" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Comment>"Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма_Валюта</Name>
					<Comment>"Сумма" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС_Валюта</Name>
					<Comment>"НДС" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего_Валюта</Name>
					<Comment>"Всего" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасходов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокОтражения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособУчетаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУчетаНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговоруПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/Documents/CW_ВводОстатковНезавершенногоПроизводства/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
		
		Дата			  = ТекущаяДата();
		Организация       = ДанныеЗаполнения.Организация;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		
		РезультатЗапроса = ПолучитьДанныеДляЗаполненияТабличнойЧасти(ДанныеЗаполнения);
		Затраты.Загрузить(РезультатЗапроса.Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.CW_НезавершенноеПроизводство.Записывать 	= Истина;
	
	Движения.CW_НезавершенноеПроизводство.Очистить();
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Ссылка КАК Ссылка,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Ссылка.Организация КАК Организация,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Ссылка.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Ссылка.Дата КАК Период,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Ссылка.ДокументОснование КАК ДокументДоходов,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.НомерСтроки КАК НомерСтроки,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Грузоперевозка КАК Грузоперевозка,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.ПорядокОтражения КАК ПорядокОтражения,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.СтавкаНДС КАК СтавкаНДС,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.СпособУчетаНДС КАК СпособУчетаНДС,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Номенклатура КАК Номенклатура,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.СтатьяЗатрат КАК СтатьяЗатрат,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Подразделение КАК Подразделение,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Количество КАК Количество,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Сумма КАК Сумма,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.НДС КАК НДС,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Всего КАК Всего,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Сумма_Валюта КАК Сумма_Валюта,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.НДС_Валюта КАК НДС_Валюта,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Всего_Валюта КАК Всего_Валюта,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Ссылка.ДокументОснование.Контрагент КАК Контрагент,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Ссылка.ДокументОснование.Договор КАК Договор,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Ссылка.ДокументОснование.ПриложениеКДоговору КАК ПриложениеКДоговору,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Ссылка.ДокументОснование КАК ДокументРасходов,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Ссылка.ДокументОснование.Валюта КАК Валюта,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Покупатель КАК Покупатель,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.ДоговорПокупателя КАК ДоговорПокупателя,
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.ПриложениеКДоговоруПокупателя КАК ПриложениеКДоговоруПокупателя
	               |ИЗ
	               |	Документ.CW_ВводОстатковНезавершенногоПроизводства.Затраты КАК CW_ВводОстатковНезавершенногоПроизводстваЗатраты
	               |ГДЕ
	               |	CW_ВводОстатковНезавершенногоПроизводстваЗатраты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.CW_НезавершенноеПроизводство.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
	
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеДляЗаполненияТабличнойЧасти(ДанныеЗаполнения) Экспорт
	
	ПорядокОтраженияДляНЗП 	= CW_УчетНЗПСервер.ПолучитьПорядокОтраженияДляУчетаВСоставеНЗП();
	мПорядокОтраженияЗатрат = ПорядокОтраженияДляНЗП["Расходы"];
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_РасходыПоГрузоперевозкеУслуги.Грузоперевозка КАК Грузоперевозка,
	               |	CW_РасходыПоГрузоперевозкеУслуги.ПорядокОтражения КАК ПорядокОтражения,
	               |	CW_РасходыПоГрузоперевозкеУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	CW_РасходыПоГрузоперевозкеУслуги.СпособУчетаНДС КАК СпособУчетаНДС,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Номенклатура КАК Номенклатура,
	               |	CW_РасходыПоГрузоперевозкеУслуги.СтатьяЗатрат КАК СтатьяЗатрат,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Подразделение КАК Подразделение,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Количество КАК Количество,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Покупатель КАК Покупатель,
	               |	CW_РасходыПоГрузоперевозкеУслуги.ДоговорПокупателя КАК ДоговорПокупателя,
	               |	CW_РасходыПоГрузоперевозкеУслуги.ПриложениеКДоговору КАК ПриложениеКДоговоруПокупателя,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка.Контрагент КАК Контрагент,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка.Договор КАК Договор,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка.ПриложениеКДоговору КАК ПриложениеКДоговору,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка КАК ДокументРасходов,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка.Валюта КАК Валюта,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Сумма КАК Сумма_Валюта,
	               |	CW_РасходыПоГрузоперевозкеУслуги.НДС КАК НДС_Валюта,
	               |	CW_РасходыПоГрузоперевозкеУслуги.Всего КАК Всего_Валюта,
	               |	CW_РасходыПоГрузоперевозкам.Сумма КАК Сумма,
	               |	CW_РасходыПоГрузоперевозкам.НДС КАК НДС,
	               |	CW_РасходыПоГрузоперевозкам.Всего КАК Всего
	               |ИЗ
	               |	Документ.CW_РасходыПоГрузоперевозке.Услуги КАК CW_РасходыПоГрузоперевозкеУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.CW_РасходыПоГрузоперевозкам КАК CW_РасходыПоГрузоперевозкам
	               |		ПО CW_РасходыПоГрузоперевозкеУслуги.НомерСтроки = CW_РасходыПоГрузоперевозкам.НомерСтроки
	               |			И (CW_РасходыПоГрузоперевозкеУслуги.ПорядокОтражения В (&мПорядокОтражения))
	               |ГДЕ
	               |	CW_РасходыПоГрузоперевозкеУслуги.Ссылка = &Регистратор
	               |	И CW_РасходыПоГрузоперевозкам.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор",		ДанныеЗаполнения.Ссылка);
	Запрос.УстановитьПараметр("мПорядокОтражения", 	мПорядокОтраженияЗатрат);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента 			= Затраты.Итог("Всего");
	СуммаДокументаВалютная 	= Затраты.Итог("Всего_Валюта");
	
КонецПроцедуры
